package HomeWork2;

public class DaySeven {
// Массив - это хранилище для элементов одного типа(int, String), доступ к этим элементам осуществляется по индексам.
// Индекс это порядковый номер, начинается всегда с 0, а значение это то что лежит в ячейке нашего массива
//    char - это символ, а String - набор символов.
//    Если сравнивать строки по " == " , то будут сравниваться ссылки, а не сам текст, поэтому если нам нужно сравнить
//    строки между собой по тексту, то лучше всего использовать equals.
//    Выносить логику в методы нужно для того чтобы не засорять метод Main, если нам понадобится определенный метод или методы,
//    мы просто вызовем его, он отработает и все, без всяких излишеств.
// Пограничные случаи, это те моменты когда программа может функционировать нормально, но если не были учтены некоторые детали поведения программы
// например (пустота, ноль, отрицательное число), то она может крашнуться. Поэтому рекомендуется предугадывать данные случаи
//    и делать небольшие проверки чтобы избежать ошибки.

}
